## Movie Recommendation System

## Step 1 Importing all the libraries

In [1]:
# Imporing libraries

import numpy as np
import pandas as pd
import warnings

In [2]:
# Filtering all the warning

warnings.filterwarnings('ignore')

In [8]:
## Get the data

columns_names = ['user_id', 'item_id','rating','timestamp']
df = pd.read_csv('ml-100k/ml-100k/u.data', sep="\t", names = columns_names)

In [9]:
df.head()

   user_id  item_id  rating  timestamp
0      196      242       3  881250949
1      186      302       3  891717742
2       22      377       1  878887116
3      244       51       2  880606923
4      166      346       1  886397596

In [10]:
df.shape

(100000, 4)

In [11]:
# get the unique users
df['user_id'].nunique()

943

In [12]:
# Get the unique movies
df['item_id'].nunique()

1682

In [21]:
# Read u.item
movies_titles = pd.read_csv('ml-100k/ml-100k/u.item',  encoding = "ISO-8859-1",sep="\|", header = None)

In [22]:
movies_titles.shape

(1682, 24)

In [27]:
movies_titles = movies_titles[[0,1]]

movies_titles.columns = ['item_id', 'title']

In [28]:
movies_titles.head()

   item_id              title
0        1   Toy Story (1995)
1        2   GoldenEye (1995)
2        3  Four Rooms (1995)
3        4  Get Shorty (1995)
4        5     Copycat (1995)

In [29]:
# Merging the two dataframes

df = pd.merge(df, movies_titles, on="item_id")

In [32]:
df.tail()

,user_id,item_id,rating,timestamp,title
99995,840,1674,4,891211682,Mamma Roma (1962)
99996,655,1640,3,888474646,"Eighth Day, The (1996)"
99997,655,1637,3,888984255,Girls Town (1996)
99998,655,1630,3,887428735,"Silence of the Palace, The (Saimt el Qusur) (1..."
99999,655,1641,3,887427810,Dadetown (1995)

## STEP 2: Exploratory Data Analysis